In [1]:
import pandas as pd

In [2]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

Q1 일일권으로 자전거를 대여한 숫자인 casual 변수의 제 1사분위수와 제 3사분위수를 계산하시오.

In [5]:
print(bike["casual"].quantile(0.25))
print(bike["casual"].quantile(0.75))

4.0
49.0

Q2 casual의 사분위범위(IQR)을 산출하여 stat_iqu이라는 객체를 저장하시오

In [7]:
stat_iqu = bike["casual"].quantile(0.75) - bike["casual"].quantile(0.25)
print(stat_iqu)

45.0

Q3 casual 변수의 이상치는 몇 개인지 확인하시오
- 제 3 사분위수 보다 1.5IQR을 넘어가는 숫자를 이상치로 간주한다.

In [11]:
sum(bike["casual"] > bike["casual"].quantile(0.75) + stat_iqu * 1.5)

749

In [12]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [20]:
bike["casual"].quantile(0.75) + stat_iqu * 1.5

116.5

### Q4 총 자전거 대여 숫자인 count 변수의 이상치를 확인하고 해당 변수의 이상치가 있는 row를 추출하여 bike_out 객체에 저장하고, 이상치를 제외한 row를 추출하여 bike_in 객체에 저장하시오. 
-이상치는 제 1 사분위수 보다 1.51IQR 보다 작서나 제 3 사분위수보다 1,51IQR보다 큰것을 기준으로 한다.

In [13]:
sum(bike["count"] > bike["count"].quantile(0.75) + stat_iqu * 1.5)

1915

In [18]:
bike_out = bike.loc[(bike["count"] > bike["count"].quantile(0.75) + stat_iqu * 1.5)]
bike_out

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
1384,2011-04-03 13:00:00,2,0,0,1,18.04,21.970,33,19.9995,219,148,367
1412,2011-04-04 17:00:00,2,0,1,1,30.34,32.575,23,40.9973,83,283,366
1413,2011-04-04 18:00:00,2,0,1,2,29.52,31.820,23,32.9975,78,308,386
1460,2011-04-06 17:00:00,2,0,1,1,21.32,25.000,32,30.0026,53,303,356
1579,2011-04-11 17:00:00,2,0,1,1,30.34,33.335,48,35.0008,100,352,452
...,...,...,...,...,...,...,...,...,...,...,...,...
10857,2012-12-18 19:00:00,4,0,1,1,15.58,19.695,46,26.0027,19,334,353
10869,2012-12-19 07:00:00,4,0,1,1,10.66,13.635,75,8.9981,3,360,363
10870,2012-12-19 08:00:00,4,0,1,1,9.84,12.880,87,7.0015,13,665,678
10879,2012-12-19 17:00:00,4,0,1,1,16.40,20.455,50,26.0027,26,536,562
10880,2012-12-19 18:00:00,4,0,1,1,15.58,19.695,50,23.9994,23,546,569

In [19]:
bike_in = bike.loc[(bike["count"] <= bike["count"].quantile(0.75) + stat_iqu * 1.5)]
bike_in

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

------------------------------------------------------------------------------

In [21]:
stat_q1 = bike["count"].quantile(0.25)
stat_q3 = bike["count"].quantile(0.75)

stat_iqr = stat_q3 - stat_q1
stat_iqr

242.0

In [26]:
condi_1 = bike["count"] < (stat_q1 - stat_iqr *1.5)
condi_2 = bike["count"] > (stat_q3 + stat_iqr *1.5)
bike_out = bike.loc[condi_1 | condi_2, ]
print(len(bike_out))
bike_out.head(2)

300

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6611,2012-03-12 18:00:00,1,0,1,2,24.6,31.06,43,12.9980,89,623,712
6634,2012-03-13 17:00:00,1,0,1,1,28.7,31.82,37,7.0015,62,614,676

In [28]:
condi_1 = bike["count"] >= (stat_q1 - stat_iqr *1.5)
condi_2 = bike["count"] <= (stat_q3 + stat_iqr *1.5)
bike_in = bike.loc[condi_1 & condi_2, ]
print(len(bike_in))
bike_in.head(2)

10586

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [30]:
bike["casual"].kurt()

7.551629305632764

In [31]:
bike["casual"].skew()

2.4957483979812567

In [32]:
bike.kurt(numeric_only=True)

season        -1.355661
holiday       30.046975
workingday    -1.397828
weather        0.395533
temp          -0.914530
atemp         -0.850076
humidity      -0.759818
windspeed      0.630133
casual         7.551629
registered     2.626081
count          1.300093
dtype: float64

In [34]:
bike_sub = bike[["temp", "atemp", "casual", "registered"]]
bike_sub.head(2)

   temp   atemp  casual  registered
0  9.84  14.395       3          13
1  9.02  13.635       8          32

In [38]:
bike_sub.corr() # pearson

                temp     atemp    casual  registered
temp        1.000000  0.984948  0.467097    0.318571
atemp       0.984948  1.000000  0.462067    0.314635
casual      0.467097  0.462067  1.000000    0.497250
registered  0.318571  0.314635  0.497250    1.000000

In [42]:
bike_sub.corr(method = "kendall")

                temp     atemp    casual  registered
temp        1.000000  0.955043  0.413319    0.240250
atemp       0.955043  1.000000  0.410275    0.237979
casual      0.413319  0.410275  1.000000    0.582213
registered  0.240250  0.237979  0.582213    1.000000

In [37]:
bike_sub.corr(method = "spearman")

                temp     atemp    casual  registered
temp        1.000000  0.987128  0.573034    0.352174
atemp       0.987128  1.000000  0.571588    0.350577
casual      0.573034  0.571588  1.000000    0.775785
registered  0.352174  0.350577  0.775785    1.000000

In [39]:
bike_sub.corr().round(2)

            temp  atemp  casual  registered
temp        1.00   0.98    0.47        0.32
atemp       0.98   1.00    0.46        0.31
casual      0.47   0.46    1.00        0.50
registered  0.32   0.31    0.50        1.00

In [46]:
from scipy.stats import pearsonr
from scipy.stats import spearmanr
from scipy.stats import kendalltau

In [47]:
stat, p = pearsonr(bike_sub["temp"], bike_sub["casual"])
print(stat)
print(p)

0.4670970641201328
0.0

In [48]:
dia = pd.read_csv("DS_lv1/diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [49]:
dia_E = dia.loc[dia["color"] == "E", ]
dia_H = dia.loc[dia["color"] == "H", ]

In [50]:
print(len(dia_E))
print(len(dia_H))

9797
8304

In [51]:
from scipy.stats import bartlett
bartlett(dia_E["price"], dia_H["price"])

BartlettResult(statistic=484.16407135967086, pvalue=2.6525226756537817e-107)

In [53]:
stat, p = bartlett(dia_E["price"], dia_H["price"])
print(stat)
print(p)

484.16407135967086
2.6525226756537817e-107

In [55]:
round(abs(stat),2)

484.16

In [56]:
round(p,5)

0.0

In [58]:
from scipy.stats import chi2_contingency
df = pd.read_csv("DS_lv1/traffic_accident.txt", sep = "\t")
df.head(2)

   seq sex serious_yn  age
0    1   M          N    3
1    2   M          N    6

In [65]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["sex"]))

(3.7895026717172966,
 0.051574970410524265,
 1,
 array([[286.99343955, 679.00656045],
        [ 30.00656045,  70.99343955]]))

In [66]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["sex"]), correction = False)

(4.248074934656112,
 0.03929484927552679,
 1,
 array([[286.99343955, 679.00656045],
        [ 30.00656045,  70.99343955]]))

In [67]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["age"]))

# 두 변수가 독립이다. 관계가 없다.

(9.410466679276956,
 0.051619825959927854,
 4,
 array([[193.74320525, 199.17525773, 209.13402062, 186.5004686 ,
         177.4470478 ],
        [ 20.25679475,  20.82474227,  21.86597938,  19.4995314 ,
          18.5529522 ]]))

-------------------------------------------------------------------------

Quiz-bank

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("DS_lv1/bank.csv", sep = ";")
df.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

### Q1. 열살 단위로 구분하는 age_g 변수를 새로 생성하시오
-30살 -> 30, 49 -> 40

In [31]:
#1 df["age_g"] = df["age"] // 10
#2 df["age_g"] = (df["age_g"]).astype("int")
df.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,age_g
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,3
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,3

### Q2 연령(age)과 예금잔고(balance)간 Pearson's 상관분석을 실시하고 그 결과를 확인하시오.

In [23]:
bank = df[["age", "balance", "marital", "y"]]
bank.head(2)

   age  balance  marital   y
0   30     1787  married  no
1   33     4789  married  no

In [24]:
bank.corr() # pearson

             age  balance
age      1.00000  0.08382
balance  0.08382  1.00000

In [13]:
from scipy.stats import pearsonr
from scipy.stats import spearmanr
from scipy.stats import kendalltau

In [26]:
stat, p = pearsonr(bank["age"], bank["balance"])
print(stat) #상관계수
print(p) #p-value

0.08382014224477763
1.658480874647685e-08

### Q3 혼인상태(marital)와 이직의사 여부(y) 간 독립성 검정을 실시하고 그 결과를 확인하시오.

In [15]:
from scipy.stats import chi2_contingency #카이제곱 검정

In [33]:
stat, p ,dof, exp = chi2_contingency(pd.crosstab(df["marital"], df["y"]))
print(p)

7.373535401823763e-05

In [35]:
chi2_contingency(pd.crosstab(bank["marital"], bank["y"]))

(19.03005634409817,
 7.373535401823763e-05,
 2,
 array([[ 467.15328467,   60.84671533],
        [2474.67374475,  322.32625525],
        [1058.17297058,  137.82702942]]))

------------------------------------------------------------------------------

## T검정 (두집단)

In [36]:
from scipy.stats import ttest_1samp

In [37]:
df = pd.read_excel("DS_lv1/iris_xlsx.xlsx")
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [38]:
stat, p = ttest_1samp(df["Sepal.Length"], popmean = 4) # population mean(모평균)
print(stat)
print(p)

27.263680640799215
8.764592435410748e-60

In [39]:
df["Sepal.Length"].mean()

5.843333333333335

In [50]:
stat, p = ttest_1samp(df["Sepal.Length"], popmean = 5.8) # population mean(모평균)
print(stat)
print(p)  # 첫째줄 검정통계량, 둘쨰중 p-value, popmean 을 늘릴 수록 귀무가설을 기각할 수 없는 상태로 간다.

0.6409183514112012
0.5225602746220779

In [54]:
from scipy.stats import ttest_rel # 대응표본
from scipy.stats import ttest_ind # 독립표본

In [55]:
ttest_rel(df["Sepal.Length"], df["Sepal.Width"])

Ttest_relResult(statistic=34.81519257082818, pvalue=1.8495537347987982e-73)

In [58]:
ttest_ind(df["Sepal.Length"], df["Sepal.Width"], equal_var=True) # 등분산 가정

Ttest_indResult(statistic=36.463283934449116, pvalue=7.027919392009369e-112)

In [57]:
ttest_ind(df["Sepal.Length"], df["Sepal.Width"], equal_var = False) # 이분산 가정

Ttest_indResult(statistic=36.46328393444912, pvalue=1.4595425075861685e-96)

In [59]:
stat, p = ttest_ind(df["Sepal.Width"], df["Sepal.Length"])
print(stat)
print(round(abs(stat),2)) # 위차가 바뀌면 부호가 바뀐다. 절댓값 쓰는거 권장

-36.463283934449116
36.46

---------------------------------------------------------------------------------

##  세 집단 감정 Scipy

In [65]:
import pandas as pd
from scipy.stats import f_oneway
df = pd.read_excel("DS_lv1/iris_xlsx.xlsx")
stat, p = f_oneway(df["Sepal.Length"],
                  df["Sepal.Width"],
                  df["Petal.Length"])
print(stat)
print(p)

236.75163298404746
7.657188374182084e-71

### StatsModels

In [66]:
import pandas as pd
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm
df = pd.read_csv("DS_lv1/diamonds.csv")
formula = "price ~ C(cut)"# C : 명목형 자료로 만들어준다. 
lm = ols(formula, df).fit()
anova_lm(lm)

               df        sum_sq       mean_sq           F         PR(>F)
C(cut)        4.0  1.104175e+10  2.760436e+09  175.688717  8.428307e-150
Residual  53935.0  8.474314e+11  1.571209e+07         NaN            NaN

In [67]:
bike = pd.read_csv("DS_lv1/bike.csv")
bike.headad(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [71]:
lm1 = ols("temp~season", bike).fit()
anova_lm(lm1)

               df         sum_sq       mean_sq           F         PR(>F)
season        1.0   44221.657301  44221.657301  780.591754  5.879560e-166
Residual  10884.0  616594.417651     56.651453         NaN            NaN

In [73]:
lm2 = ols("temp~C(season)", bike).fit() # C : F 검정통계량 
anova_lm(lm2)

                df         sum_sq        mean_sq            F  PR(>F)
C(season)      3.0  412885.270005  137628.423335  6040.687453     0.0
Residual   10882.0  247930.804947      22.783570          NaN     NaN

In [74]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [78]:
dia = pd.read_csv("DS_lv1/diamonds.csv")
posthoc = pairwise_tukeyhsd(df["price"], df["cut"])
print(posthoc) # reject : 유의수준 5%기준 귀무가설 기각여부(True는 기각)

     Multiple Comparison of Means - Tukey HSD, FWER=0.05
==============================================================
 group1   group2   meandiff p-adj    lower      upper   reject
--------------------------------------------------------------
   Fair      Good -429.8933 0.0015  -740.4567 -119.3299   True
   Fair     Ideal -901.2158  0.001 -1180.5785 -621.8531   True
   Fair   Premium  225.4999  0.195   -59.2739  510.2738  False
   Fair Very Good -376.9979 0.0031  -663.8694  -90.1263   True
   Good     Ideal -471.3225  0.001   -642.367 -300.2779   True
   Good   Premium  655.3933  0.001   475.6466  835.1399   True
   Good Very Good   52.8954    0.9  -130.1565  235.9474  False
  Ideal   Premium 1126.7157  0.001  1008.8058 1244.6257   True
  Ideal Very Good  524.2179  0.001   401.3281  647.1078   True
Premium Very Good -602.4978  0.001  -737.2366 -467.7591   True
--------------------------------------------------------------